package screens

import (
	"ruffnut/ui/theme"
)

var logo string = `

▗▄▄▄▖▗▖ ▗▖▗▄▄▄▖▗▄▄▄▖▗▖  ▗▖▗▖ ▗▖▗▄▄▄▖
  █  ▐▌ ▐▌▐▌   ▐▌   ▐▛▚▖▐▌▐▌ ▐▌  █  
  █  ▐▌ ▐▌▐▛▀▀▘▐▛▀▀▘▐▌ ▝▜▌▐▌ ▐▌  █  
  █  ▝▚▄▞▘▐▌   ▐▌   ▐▌  ▐▌▝▚▄▞▘  █  
                                                                                                                                                                                                           
`

func HomeView(styles theme.Styles) string {
	s := styles.Opener.Render(logo)
	return s
}
